In [1]:
import numpy as np

In [3]:
import pandas as pd

OBJETOS

In [4]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [ ]:
s

In [6]:
dates = pd.date_range("20130101", periods=6)

In [7]:
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [8]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))

In [9]:
df

                   A         B         C         D
2013-01-01  1.267135 -1.297157 -1.752073 -0.541188
2013-01-02  1.365096 -0.172806 -1.147738  0.029359
2013-01-03  0.445081 -1.009968 -0.300200 -0.560361
2013-01-04 -1.977169 -0.192958  0.239951  2.247272
2013-01-05  1.629597 -0.385966  0.139412  1.335901
2013-01-06  1.508351 -1.162198  0.302323 -1.902406

In [10]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)

In [11]:
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

In [13]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

VER DATOS

In [19]:
df.head  #primeros datos

<bound method NDFrame.head of                    A         B         C         D
2013-01-01  1.267135 -1.297157 -1.752073 -0.541188
2013-01-02  1.365096 -0.172806 -1.147738  0.029359
2013-01-03  0.445081 -1.009968 -0.300200 -0.560361
2013-01-04 -1.977169 -0.192958  0.239951  2.247272
2013-01-05  1.629597 -0.385966  0.139412  1.335901
2013-01-06  1.508351 -1.162198  0.302323 -1.902406>

In [20]:
df.tail  #ultimos datos

<bound method NDFrame.tail of                    A         B         C         D
2013-01-01  1.267135 -1.297157 -1.752073 -0.541188
2013-01-02  1.365096 -0.172806 -1.147738  0.029359
2013-01-03  0.445081 -1.009968 -0.300200 -0.560361
2013-01-04 -1.977169 -0.192958  0.239951  2.247272
2013-01-05  1.629597 -0.385966  0.139412  1.335901
2013-01-06  1.508351 -1.162198  0.302323 -1.902406>

In [21]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [22]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [23]:
df.to_numpy

<bound method DataFrame.to_numpy of                    A         B         C         D
2013-01-01  1.267135 -1.297157 -1.752073 -0.541188
2013-01-02  1.365096 -0.172806 -1.147738  0.029359
2013-01-03  0.445081 -1.009968 -0.300200 -0.560361
2013-01-04 -1.977169 -0.192958  0.239951  2.247272
2013-01-05  1.629597 -0.385966  0.139412  1.335901
2013-01-06  1.508351 -1.162198  0.302323 -1.902406>

In [24]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [25]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [26]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.706349 -0.703509 -0.419721  0.101429
std    1.379388  0.509877  0.847184  1.483242
min   -1.977169 -1.297157 -1.752073 -1.902406
25%    0.650595 -1.124141 -0.935853 -0.555568
50%    1.316116 -0.697967 -0.080394 -0.255915
75%    1.472537 -0.241210  0.214817  1.009266
max    1.629597 -0.172806  0.302323  2.247272

In [27]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A    1.267135    1.365096    0.445081   -1.977169    1.629597    1.508351
B   -1.297157   -0.172806   -1.009968   -0.192958   -0.385966   -1.162198
C   -1.752073   -1.147738   -0.300200    0.239951    0.139412    0.302323
D   -0.541188    0.029359   -0.560361    2.247272    1.335901   -1.902406

In [28]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01 -0.541188 -1.752073 -1.297157  1.267135
2013-01-02  0.029359 -1.147738 -0.172806  1.365096
2013-01-03 -0.560361 -0.300200 -1.009968  0.445081
2013-01-04  2.247272  0.239951 -0.192958 -1.977169
2013-01-05  1.335901  0.139412 -0.385966  1.629597
2013-01-06 -1.902406  0.302323 -1.162198  1.508351

In [29]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-01  1.267135 -1.297157 -1.752073 -0.541188
2013-01-06  1.508351 -1.162198  0.302323 -1.902406
2013-01-03  0.445081 -1.009968 -0.300200 -0.560361
2013-01-05  1.629597 -0.385966  0.139412  1.335901
2013-01-04 -1.977169 -0.192958  0.239951  2.247272
2013-01-02  1.365096 -0.172806 -1.147738  0.029359

SELECTION

In [30]:
df["A"]

2013-01-01    1.267135
2013-01-02    1.365096
2013-01-03    0.445081
2013-01-04   -1.977169
2013-01-05    1.629597
2013-01-06    1.508351
Freq: D, Name: A, dtype: float64

In [33]:
df[0:3]

                   A         B         C         D
2013-01-01  1.267135 -1.297157 -1.752073 -0.541188
2013-01-02  1.365096 -0.172806 -1.147738  0.029359
2013-01-03  0.445081 -1.009968 -0.300200 -0.560361

In [34]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02  1.365096 -0.172806 -1.147738  0.029359
2013-01-03  0.445081 -1.009968 -0.300200 -0.560361
2013-01-04 -1.977169 -0.192958  0.239951  2.247272

In [35]:
df.loc[dates[0]]

A    1.267135
B   -1.297157
C   -1.752073
D   -0.541188
Name: 2013-01-01 00:00:00, dtype: float64

In [36]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01  1.267135 -1.297157
2013-01-02  1.365096 -0.172806
2013-01-03  0.445081 -1.009968
2013-01-04 -1.977169 -0.192958
2013-01-05  1.629597 -0.385966
2013-01-06  1.508351 -1.162198

In [37]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02  1.365096 -0.172806
2013-01-03  0.445081 -1.009968
2013-01-04 -1.977169 -0.192958

In [38]:
df.loc[dates[0], "A"]

1.2671353977549096

In [39]:
df.at[dates[0], "A"]

1.2671353977549096

In [40]:
df.iloc[3]

A   -1.977169
B   -0.192958
C    0.239951
D    2.247272
Name: 2013-01-04 00:00:00, dtype: float64

In [41]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.977169 -0.192958
2013-01-05  1.629597 -0.385966

In [42]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02  1.365096 -1.147738
2013-01-03  0.445081 -0.300200
2013-01-05  1.629597  0.139412

In [43]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02  1.365096 -0.172806 -1.147738  0.029359
2013-01-03  0.445081 -1.009968 -0.300200 -0.560361

In [44]:
df.iloc[:, 1:3]

                   B         C
2013-01-01 -1.297157 -1.752073
2013-01-02 -0.172806 -1.147738
2013-01-03 -1.009968 -0.300200
2013-01-04 -0.192958  0.239951
2013-01-05 -0.385966  0.139412
2013-01-06 -1.162198  0.302323

In [45]:
df.iloc[1, 1]

-0.17280637111151959

In [46]:
df.iat[1, 1]

-0.17280637111151959